#### python time, time.time 관련된 부분 python_함수에서 찾아서 하기

- 참고 : https://ellun.tistory.com/320
- https://docs.python.org/ko/3/library/datetime.html

In [4]:
# timestamp -> str
import time 
print(time.time()) #1970년대 어쩌구
type(time.time())
timestamp = time.time()
s = str(timestamp) #time을 문자로 만들어줄 필요가 있을 때 바꿔줄 수 있다.
print(s,type(s))

1626746931.1758249
1626746931.176608 <class 'str'>

In [13]:
# datetime->str로 바꾸기
from datetime import datetime
s = datetime.now()
print(s,type(s))

s1 = datetime.now().strftime('%Y-%m-%d %H:%M:%S')  #string+format = strf
print(s1,type(s1))    #얘는 str이니까 날짜 계산이 안되는 것임

2021-07-20 11:14:12.592864 <class 'datetime.datetime'>
2021-07-20 11:14:12 <class 'str'>

In [96]:
# str -> datetime
from datetime import datetime
s = '2021-07-20 11:14:12'
s2 = datetime.strptime(s, '%Y-%m-%d %H:%M:%S') #string parsing

print(s2, type(s2))

2021-07-20 11:14:12 <class 'datetime.datetime'>

In [97]:
# str -> timestamp로 바꾸기
s = '2021-07-20 11:14:12'

#str을 datetime으로 바꾼 후 mk함수에 집어넣어줘서 timetuple로 뽑아주는 것. 그래서 timestamp로 바꿈

timestamp = time.mktime(datetime.strptime(s, '%Y-%m-%d %H:%M:%S').timetuple()) 
print(timestamp,type(timestamp))

1626747252.0 <class 'float'>

In [98]:
# datetime -> timestamp
datetime.today()

timestamp = time.mktime(datetime.today().timetuple())

print(timestamp, type(timestamp))

1626751312.0 <class 'float'>

In [99]:
# timestamp -> datetime으로 바꾸기
t = time.time() #timestamp
print(t)
d = datetime.fromtimestamp(t)

print(d, type(d))

1626751314.443421
2021-07-20 12:21:54.443421 <class 'datetime.datetime'>

In [101]:
# 판다스 to_datetime
pd.to_datetime(1626751314.443421, unit='s')

# 출력이 timestamp라고 되기는 하지만, datetime임 판다스에서의 datetime임
# to_datetime은 float(파이썬의 datetime형식)를 datetime으로 바꿔줌

Timestamp('2021-07-20 03:21:54.443420928')

In [32]:
# 1년전 datetime 값
from datetime import timedelta
import time

datetime_now = datetime.now()
delta_datetime = timedelta(days=-365)

print(delta_datetime)

one_year_ago = datetime_now + delta_datetime
one_year_ago

-365 days, 0:00:00

datetime.datetime(2020, 7, 20, 11, 32, 27, 43061)

In [34]:
# 두 날짜간의 일수 구하기
since_timestamp = datetime.strptime('20180301', '%Y%m%d')
until_timestamp = datetime.strptime('20180331', '%Y%m%d')

a = until_timestamp - since_timestamp

print(a, type(a))

30 days, 0:00:00 <class 'datetime.timedelta'>

In [66]:
# 특정일 구하기
import datetime
def get_yoil(y,m,d):
    days = ['MON','TUE','WED','THU','FRI','SAT','SUN']
    return days[datetime.date(y,m,d).weekday()]

get_yoil(2021,7,20)

'TUE'

In [43]:
import pandas as pd
date = pd.Timestamp(1626747925.0, unit='s',tz='Asia/Seoul')
#timezone을 아시아/서울로해서 1970년대 어쩌구 시간이 우리나라 시간으로 치환돼서 나오는 것임. unit='s'는 seconds, 초
print(date,type(date))

2021-07-20 11:25:25+09:00 <class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [80]:
import pandas as pd
df = pd.read_csv('dataset/stock-data.csv')
df.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [81]:
df.info() #date가 object 즉, 문자로 돼 있음 변환해줘야함

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [82]:
df = df.replace({'Date':int})

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [83]:
df['New_Date'] = pd.to_datetime(df['Date'])
print(df.info())

df.drop('Date',axis=1, inplace=True) #Date 항목삭제

df['year'] = df['New_Date'].dt.year
df['month'] = df['New_Date'].dt.month
df['day'] = df['New_Date'].dt.day

df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   New_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB
None

   Close  Start   High    Low  Volume   New_Date  year  month  day
0  10100  10850  10900  10000  137977 2018-07-02  2018      7    2
1  10700  10550  10900   9990  170253 2018-06-29  2018      6   29
2  10400  10900  10950  10150  155769 2018-06-28  2018      6   28
3  10900  10800  11050  10500  133548 2018-06-27  2018      6   27
4  10800  10900  11000  10700   63039 2018-06-26  2018      6   26

In [84]:
df.set_index('New_Date',inplace=True)
df.head()

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-07-02  10100  10850  10900  10000  137977  2018      7    2
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [86]:
df.index

DatetimeIndex(['2018-07-02', '2018-06-29', '2018-06-28', '2018-06-27',
               '2018-06-26', '2018-06-25', '2018-06-22', '2018-06-21',
               '2018-06-20', '2018-06-19', '2018-06-18', '2018-06-15',
               '2018-06-14', '2018-06-12', '2018-06-11', '2018-06-08',
               '2018-06-07', '2018-06-05', '2018-06-04', '2018-06-01'],
              dtype='datetime64[ns]', name='New_Date', freq=None)

In [104]:
df_ymd_range=df['2018-06-25':'2018-06-29']

df_ymd_range

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [103]:
df_ym=df.loc['2018-07', 'Start':'High']
df_ym

            Start   High
New_Date
2018-07-02  10850  10900

In [102]:
# 이거 왜 안될까?
df_ymd_range = df['2018-06-29':'2018-06-26']
df_ymd_range

Empty DataFrame
Columns: [Close, Start, High, Low, Volume, year, month, day]
Index: []

In [108]:
# Time Series Basics
import numpy as np
import pandas as pd

from datetime import datetime
dates = [datetime(2011,1,2),datetime(2011,1,5),
         datetime(2011,1,7),datetime(2011,1,8),
         datetime(2011,1,10),datetime(2011,1,12)]
ts = pd.Series(np.random.randn(6),index=dates)
ts

# 날짜별로 숫자들을 랜덤하게 뽑은 것.

2011-01-02   -0.094863
2011-01-05   -0.577987
2011-01-07   -0.434135
2011-01-08   -0.624827
2011-01-10   -1.008091
2011-01-12   -0.082314
dtype: float64

In [109]:
ts.index

DatetimeIndex(['2011-01-02', '2011-01-05', '2011-01-07', '2011-01-08',
               '2011-01-10', '2011-01-12'],
              dtype='datetime64[ns]', freq=None)

In [110]:
ts[::2]

2011-01-02   -0.094863
2011-01-07   -0.434135
2011-01-10   -1.008091
dtype: float64

In [112]:
# 날짜별로 값 연산
ts + ts[::2]

2011-01-02   -0.189726
2011-01-05         NaN
2011-01-07   -0.868270
2011-01-08         NaN
2011-01-10   -2.016182
2011-01-12         NaN
dtype: float64

In [113]:
ts.add(ts[::2], fill_value=0)

2011-01-02   -0.189726
2011-01-05   -0.577987
2011-01-07   -0.868270
2011-01-08   -0.624827
2011-01-10   -2.016182
2011-01-12   -0.082314
dtype: float64

In [114]:
ts.index[0]

Timestamp('2011-01-02 00:00:00')

In [116]:
# indexing, Selection, Substting
stamp = ts.index[2]
ts[stamp]

-0.4341350250363889

In [117]:
# 2011-01-10 -1.008091
# 판다스는 날짜 형식을 넣어주지 않아도 그냥 해줌. 파이썬은 %Y이런거 해줬어야 했는데
print(ts['1/10/2011'])
ts['20110110']

-1.008090797166731

-1.008090797166731

In [118]:
longer_ts = pd.Series(np.random.randn(1000),
                      index=pd.date_range('1/1/2000',periods=1000))
print(longer_ts,'\n')

2000-01-01    0.039236
2000-01-02    2.195693
2000-01-03   -2.153309
2000-01-04    1.007582
2000-01-05    0.598258
                ...
2002-09-22    0.618611
2002-09-23    0.400850
2002-09-24    1.281385
2002-09-25    0.549510
2002-09-26    0.334592
Freq: D, Length: 1000, dtype: float64

In [119]:
longer_ts['2001']

2001-01-01    0.689747
2001-01-02   -0.962895
2001-01-03   -2.456295
2001-01-04   -0.937062
2001-01-05   -0.040071
                ...
2001-12-27    0.074289
2001-12-28    1.270534
2001-12-29    0.160730
2001-12-30   -0.508701
2001-12-31   -0.661328
Freq: D, Length: 365, dtype: float64

In [120]:
longer_ts['2001-05'][:5]

2001-05-01   -0.607802
2001-05-02    0.193207
2001-05-03    0.090980
2001-05-04    1.156583
2001-05-05   -1.161094
Freq: D, dtype: float64

In [121]:
ts

2011-01-02   -0.094863
2011-01-05   -0.577987
2011-01-07   -0.434135
2011-01-08   -0.624827
2011-01-10   -1.008091
2011-01-12   -0.082314
dtype: float64

In [122]:
ts[datetime(2011,1,7):]

2011-01-07   -0.434135
2011-01-08   -0.624827
2011-01-10   -1.008091
2011-01-12   -0.082314
dtype: float64

In [124]:
ts

2011-01-02   -0.094863
2011-01-05   -0.577987
2011-01-07   -0.434135
2011-01-08   -0.624827
2011-01-10   -1.008091
2011-01-12   -0.082314
dtype: float64

In [127]:
# truncate : 반올림하는게 아니라 소수점 있으면 버림하는 것. 
print(ts.truncate(before='2011-01-05',after='2011-01-07'))

2011-01-05   -0.577987
2011-01-07   -0.434135
dtype: float64

In [128]:
print(ts.truncate(after='1/9/2011'))  #이 날짜 이전게 나옴

2011-01-02   -0.094863
2011-01-05   -0.577987
2011-01-07   -0.434135
2011-01-08   -0.624827
dtype: float64

In [129]:
pd.date_range('2020-10-7','2020-10-20')

DatetimeIndex(['2020-10-07', '2020-10-08', '2020-10-09', '2020-10-10',
               '2020-10-11', '2020-10-12', '2020-10-13', '2020-10-14',
               '2020-10-15', '2020-10-16', '2020-10-17', '2020-10-18',
               '2020-10-19', '2020-10-20'],
              dtype='datetime64[ns]', freq='D')

시계열 함수 정리 링크 https://predictors.tistory.com/26

In [131]:
from datetime import datetime
from datetime import timedelta
now = datetime.now()
in_two_weeks = now + timedelta(weeks=2)

pd.date_range(datetime.now(),in_two_weeks)

DatetimeIndex(['2021-07-20 14:11:52.432812', '2021-07-21 14:11:52.432812',
               '2021-07-22 14:11:52.432812', '2021-07-23 14:11:52.432812',
               '2021-07-24 14:11:52.432812', '2021-07-25 14:11:52.432812',
               '2021-07-26 14:11:52.432812', '2021-07-27 14:11:52.432812',
               '2021-07-28 14:11:52.432812', '2021-07-29 14:11:52.432812',
               '2021-07-30 14:11:52.432812', '2021-07-31 14:11:52.432812',
               '2021-08-01 14:11:52.432812', '2021-08-02 14:11:52.432812'],
              dtype='datetime64[ns]', freq='D')

In [133]:
# 구간이 4개고, 기간이 5개인 것. 기간 사이사이가 4개니까. periods는 기간을 나타낸다. 
pd.date_range(start='2020-10-01', end='2020-10-20',periods=5)

DatetimeIndex(['2020-10-01 00:00:00', '2020-10-05 18:00:00',
               '2020-10-10 12:00:00', '2020-10-15 06:00:00',
               '2020-10-20 00:00:00'],
              dtype='datetime64[ns]', freq=None)